* Work log
** General time
   :LOGBOOK:
   CLOCK: [2018-01-21 Sun 16:25]--[2018-01-21 Sun 18:15] =>  1:50
   CLOCK: [2018-01-21 Sun 13:20]--[2018-01-21 Sun 15:28] =>  2:08
   CLOCK: [2018-01-20 Sat 18:03]--[2018-01-20 Sat 20:25] =>  2:22
   CLOCK: [2018-01-19 Fri 23:20]--[2018-01-20 Sat 00:50] =>  1:30
   CLOCK: [2018-01-18 Thu 20:30]--[2018-01-18 Thu 23:47] =>  3:17
   CLOCK: [2018-01-18 Thu 00:13]--[2018-01-18 Thu 00:42] =>  0:29
   CLOCK: [2018-01-17 Wed 18:47]--[2018-01-18 Thu 00:13] =>  5:26
   CLOCK: [2018-01-17 Wed 00:42]--[2018-01-17 Wed 02:29] =>  1:47
   CLOCK: [2018-01-16 Tue 19:30]--[2018-01-16 Tue 22:36] =>  3:06
   CLOCK: [2018-01-15 Mon 19:20]--[2018-01-16 Tue 00:55] =>  5:35
   CLOCK: [2018-01-14 Sun 17:05]--[2018-01-14 Sun 20:49] =>  3:44
   CLOCK: [2018-01-13 Sat 17:06]--[2018-01-13 Sat 18:07] =>  1:01
   CLOCK: [2018-01-12 Fri 20:16]--[2018-01-13 Sat 01:31] =>  5:15
   CLOCK: [2018-01-11 Thu 19:10]--[2018-01-12 Fri 00:15] =>  5:05
   CLOCK: [2018-01-10 Wed 20:06]--[2018-01-11 Thu 00:12] =>  4:06
   CLOCK: [2018-01-09 Tue 18:39]--[2018-01-09 Tue 23:41] =>  5:02
   CLOCK: [2018-01-08 Mon 22:10]--[2018-01-09 Tue 01:58] =>  3:48
   CLOCK: [2018-01-08 Mon 19:20]--[2018-01-08 Mon 21:03] =>  1:43
   CLOCK: [2018-01-08 Mon 18:35]--[2018-01-08 Mon 18:54] =>  0:19
   CLOCK: [2018-01-07 Sun 19:36]--[2018-01-07 Sun 20:35] =>  0:59
   CLOCK: [2018-01-07 Sun 16:52]--[2018-01-07 Sun 19:00] =>  2:08
   CLOCK: [2018-01-07 Sun 14:06]--[2018-01-07 Sun 14:56] =>  0:50
   CLOCK: [2018-01-05 Fri 20:12]--[2018-01-06 Sat 01:12] =>  5:00
   :END:


* Sunday checklist
  - [X] Fix not being able to place the last block
    - add a timeout
  - [X] Fix the dang word wrapping
    - hardcode the newlines fuck it
  - [X] Move buttons into tutorial
  - [X] Round end report counter shadow
  - [X] Dang round end mouse delay
  - [X] Put fullscreen on the controls list
  - [X] Reset the timers (splash/build/etc)
  - [X] Play through it a bunch of times on the native & web versions
  - [X] Grab screenshots
  - [X] Write description
  - [ ] Make sure the final code is committed
  - [ ] Upload HTML/Windows to itch.io
  - [ ] Submit to awful jams
  - [ ] Play the fuck outta doki doki literature club

* Todo
** Feedback
*** TODO make the word wrapping not bad
*** TODO menu music
*** TODO HTML export is weirdly buggy
    120hz monitors... I guess I need to provide native files as well
    as HTML5.
** Features
*** TODO show how many people you need to win at the start of a map
    ehhh this is on the round end screen, maybe thats enough?
*** TODO flood the map when you win
    tick the molasses real fast or somethin.
*** TODO it's hard to tell that diagonals aren't connected
*** TODO placing delay feels a bit nasty
    it just kinda makes the game feel laggy right now, i think because
    a) it's slightly too long and b) it also affects the rotation and
    it probably shouldn't.
** Bugs
*** TODO if you enclose molasses in an area you destroy it
    if the molasses starts in the center you can just remove it by
    enclosing it. this is harder than it seems because you can have
    separate enclosed areas and i need to filling only the one with molasses in.
*** DONE sometimes survivors don't teleport to broken walls (but still fix them)
** Done
*** DONE make cutscenes just 1 screen
*** DONE Diagonals
    I think this is fixed by virtue of people being able to repair
    diagonals now.
*** DONE quick reset
*** DONE people can get stuck in repair mode
    Think it happens when walls break mid-repair. Maybe done?
*** DONE the ending screen when you lose doesn't make sense
*** DONE sometimes people end up in the molasses and live
    haven't actually seen this. need to find repro.
*** DONE buildings on main street not counting as walls
*** DONE second map
*** DONE rally points
*** DONE teleport survivors in enclosed areas to broken walls
    flood fill to find a broken wall they can actually get to, then
    teleport 'em there.
*** DONE run the floodfill during the molasses phase
    when a wall gets broken you should immediately see the area get
    un-enclosed.
*** DONE remove non-enclosed molasses at the end of each round 
*** DONE people to rescue
*** DONE fix droplets being able to land on molasses
*** DONE can't build in enclosed areas
    jesus christ my brain is fried i cannot figure out the conditional
    for this.
*** DONE rotation
*** DONE if you spam click you can build more walls than you should be able to
*** DONE shuffle the pieces
*** DONE get one following the mouse with snapping n stuff
*** DONE drop delay
*** DONE molasses!! - done for now..
*** DONE 1 tile border around the edge to stop game breaking stuff
*** DONE droplets


* Ideas etc
** The Great Molasses Flood
** General game flow
   1. Building phase, trying to rescue people.
   2. Molasses spreads
   3. Droplets get launched
   4. Counter-attack
** Molasses starts off in one of the corners, spreads according to some simple rules
   
